JohnDevine/ESP32-MQTT-Weather/src/main.c
 * ESP32-MQTT-WEATHER Configurable Sensor System
 * 
 * This project implements an ESP32-based sensor monitoring system that reads
 * data from configurable sensors and publishes the measurements to an MQTT broker.
 * 
 * FEATURES:
 * - Runtime configurable sensor enable/disable through web interface
 * - Multiple sensor support with individual MQTT topics
 * - MQTT connectivity with automatic reconnection handling
 * - WiFi configuration with captive portal for easy setup
 * - Web-based configuration interface for all parameters
 * - Watchdog timer for system reliability
 * - Persistent configuration storage (NVS)
 * - Automatic version management and build automation
 * 
 * HARDWARE REQUIREMENTS:
 * - ESP32 development board
 * - Supported sensors: BH1750 (light), BME680 (environmental), etc.
 * - Pull-up resistors for I2C lines if using I2C (typically 4.7 kilo-ohm (kOhm))
 * 
 * DATA OUTPUT:
 * - Combined JSON message with processor metrics and all enabled sensor data
 * - Individual sensor enable/disable configuration
 * - JSON format via MQTT for integration with home automation systems
 * 
 * CUSTOMIZATION POINTS:
 * Search for "TEMPLATE:" comments throughout the code to find areas that need
 * customization for your specific sensor(s) and use case.
 */
/**
 * @file main.c
 * @brief Main entry point for ESP32-MQTT-Weather configurable sensor system.
 * @author JohnDevine
 * @date 2025

// ==========================
//   FUNCTION DECLARATIONS
// ==========================

// NVS management functions
static void load_watchdog_counter_from_nvs(void);   // Loads watchdog counter from NVS
static void save_watchdog_counter_to_nvs(void);     // Saves watchdog counter to NVS

// System info functions
static int32_t get_wifi_rssi_percent(void);         // Gets WiFi RSSI as percent
static char* get_ip_address(void);                  // Gets device IP address
static float get_cpu_temperature(void);             // Gets CPU temperature
static char* get_software_version(void);            // Gets software version string
static char* get_chip_id(void);                     // Gets chip ID string

// DNS hijack task
void dns_hijack_task(void *pvParameter);            // DNS hijack task

// Utility functions
void url_decode(char *dst, const char *src, size_t dstsize); // Decodes URL-encoded strings

// HTTP handler functions
static esp_err_t params_json_get_handler(httpd_req_t *req);      // Handles /params.json GET
static esp_err_t params_update_post_handler(httpd_req_t *req);   // Handles /update POST
static esp_err_t parameters_html_handler(httpd_req_t *req);      // Handles /parameters.html GET
static esp_err_t captive_redirect_handler(httpd_req_t *req);     // Handles captive portal redirect
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req);     // Handles /sysinfo.json GET
static esp_err_t ota_firmware_handler(httpd_req_t *req);         // Handles OTA firmware upload
static esp_err_t ota_filesystem_handler(httpd_req_t *req);       // Handles OTA filesystem upload

// Wi-Fi and MQTT functions
static void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data); // WiFi event handler
static void mqtt_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data); // MQTT event handler
static bool test_mqtt_broker_connectivity(const char* broker_url); // Tests MQTT broker connectivity
static bool check_wifi_connection(void);                // Checks WiFi connection
void wifi_init_sta(void);                               // Initializes WiFi in station mode
static void mqtt_app_start(void);                       // Starts MQTT client
void publish_sensor_data_mqtt(const char* topic, const char* json_data); // Publishes sensor data (legacy)
void publish_combined_sensor_mqtt(const char* topic, const char* json_data); // Publishes combined sensor data
 * - ESP_LOG_ERROR   (E) - Error conditions
 * - ESP_LOG_WARN    (W) - Warning conditions  
 * - ESP_LOG_INFO    (I) - Informational messages
 * - ESP_LOG_DEBUG   (D) - Debug messages
 * - ESP_LOG_VERBOSE (V) - Verbose debug messages
 * 
 * To set global log level in menuconfig:
 * Component config > Log output > Default log verbosity
 * 
 * To set at runtime: esp_log_level_set("*", ESP_LOG_DEBUG);
 */
// #define LOG_LOCAL_LEVEL ESP_LOG_DEBUG

// Standard C input/output library
#include <stdio.h>
// FreeRTOS real-time operating system definitions
#include "freertos/FreeRTOS.h"
// FreeRTOS task management
#include "freertos/task.h"
// ESP32 GPIO driver
#include "driver/gpio.h"
// TEMPLATE: Include sensor-specific drivers here
// Examples:
// - I2C: #include "driver/i2c_master.h"
// - SPI: #include "driver/spi_master.h"
// - UART: #include "driver/uart.h"
// - ADC: #include "esp_adc/adc_oneshot.h"
#include "driver/i2c_master.h"  // Remove if not using I2C
// ESP-IDF logging library
#include "esp_log.h"
// Standard C string manipulation library (for memcmp)
#include <string.h> 

// Sensor configuration system
#include "sensor_config.h"
#include "i2c_scanner.h"  // I2C diagnostic tool

// Added for Wi-Fi and MQTT
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "mqtt_client.h"
#include "cJSON.h" // For JSON formatting
#include "esp_spiffs.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_efuse.h"
#include "esp_http_server.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>

// ==========================
//        INCLUDES
// ==========================

#include <stdio.h>                // Standard C input/output library
#include "freertos/FreeRTOS.h"    // FreeRTOS OS definitions
#include "freertos/task.h"        // FreeRTOS task management
#include "driver/gpio.h"          // ESP32 GPIO driver
#include "driver/i2c_master.h"    // I2C driver (remove if not using I2C)
#include "esp_log.h"              // ESP-IDF logging library
#include <string.h>                // Standard C string manipulation library

#include "sensor_config.h"        // Sensor configuration system
#include "i2c_scanner.h"          // I2C diagnostic tool

#include "esp_wifi.h"             // Wi-Fi driver
#include "esp_event.h"            // Event loop library
#include "nvs_flash.h"            // Non-volatile storage (NVS) library
#include "lwip/err.h"             // lwIP error codes
#include "lwip/sys.h"             // lwIP system functions
#include "mqtt_client.h"          // MQTT client library
#include "cJSON.h"                // For JSON formatting
#include "esp_spiffs.h"           // SPIFFS filesystem support
#include "esp_system.h"           // ESP32 system functions
#include "esp_mac.h"              // MAC address functions
#include "esp_efuse.h"            // eFuse access
#include "esp_http_server.h"      // HTTP server library
#include "lwip/sockets.h"         // lwIP sockets
#include "lwip/netdb.h"           // lwIP network database
#include <sys/socket.h>            // POSIX sockets
#include <netinet/in.h>            // Internet address family
#include <arpa/inet.h>             // IP address conversion
#include <errno.h>                 // Error number definitions
#include "esp_chip_info.h"         // Chip info functions
#include "esp_ota_ops.h"          // OTA update functions
#include "esp_flash.h"            // Flash memory functions
#include "spi_flash_mmap.h"       // SPI flash memory mapping
#include "project_version.h"      // Single source of truth for version
#include "esp_partition.h"        // Partition management
#include "esp_http_server.h"      // HTTP server (duplicate include)

#include "esp_task_wdt.h"         // Watchdog timer
#include "esp_netif.h"            // Network interface

// ==========================
//   GLOBAL VARIABLES
// ==========================

// Software watchdog variables
static uint32_t watchdog_timeout_ms = 0;        // Watchdog timeout (10× sample interval)
static TickType_t last_successful_publish = 0;  // Last successful MQTT publish time
static bool watchdog_enabled = false;           // Whether watchdog is enabled
static bool mqtt_publish_success = false;       // Flag for successful MQTT publish

/**
 * @var debug_logging
 * @brief Enables or disables debug logging output for main.c
 * @uml{attribute: debug_logging}
 */
static bool debug_logging = false;              // Debug logging flag

#define WIFI_NVS_NAMESPACE "wifi_cfg"           // NVS namespace for WiFi config
#define WIFI_NVS_KEY_SSID "ssid"                // NVS key for WiFi SSID
#define WIFI_NVS_KEY_PASS "pass"                // NVS key for WiFi password
#define MQTT_NVS_KEY_URL "broker_url"           // NVS key for MQTT broker URL
#define NVS_KEY_SAMPLE_INTERVAL "sample_interval"// NVS key for sample interval
#define NVS_KEY_DATA_TOPIC "data_topic"         // NVS key for MQTT data topic
#define NVS_KEY_WATCHDOG_COUNTER "watchdog_cnt" // NVS key for watchdog counter
#define DEFAULT_WIFI_SSID "yourSSID"            // Default WiFi SSID
#define DEFAULT_WIFI_PASS "yourpassword"        // Default WiFi password
#define DEFAULT_MQTT_BROKER_URL "mqtt://test.mosquitto.org:1883" // Default MQTT broker URL
#define DEFAULT_SAMPLE_INTERVAL 5000L            // Default sample interval (ms)

static char wifi_ssid[33] = DEFAULT_WIFI_SSID;   // WiFi SSID buffer
static char wifi_pass[65] = DEFAULT_WIFI_PASS;   // WiFi password buffer
static char mqtt_broker_url[128] = DEFAULT_MQTT_BROKER_URL; // MQTT broker URL buffer
char data_topic[41] = "sensor/baanfarang/weather/office01"; // Default MQTT topic for sensor data
static long sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;    // Sample interval in ms
static uint32_t watchdog_reset_counter = 0;     // Watchdog timer reset counter

#define BOOT_BTN_GPIO GPIO_NUM_0                 // GPIO for boot button

// Tag used for logging messages from this module
static const char *TAG = "DATA_READER";         // Logging tag

