JohnDevine/ESP32-MQTT-Weather/src/main.c
#define EXAMPLE_ESP_MAXIMUM_RETRY  5             // Max WiFi retry attempts
#define MQTT_BROKER_URL "mqtt://192.168.1.5"    // MQTT broker URL (unused)

// Global variable for MQTT client
static esp_mqtt_client_handle_t mqtt_client;     // MQTT client handle
static int wifi_retry_num = 0;                   // WiFi retry counter
static char* get_ip_address(void);                ///< Gets device IP address
static float get_cpu_temperature(void);           ///< Gets CPU temperature
static char* get_software_version(void);          ///< Gets software version string
static char* get_chip_id(void);                   ///< Gets chip ID string

// DNS hijack
void dns_hijack_task(void *pvParameter);          ///< DNS hijack task

// Utility
void url_decode(char *dst, const char *src, size_t dstsize); ///< Decodes URL-encoded strings

// HTTP handlers
static esp_err_t params_json_get_handler(httpd_req_t *req); ///< Handles /params.json GET
static esp_err_t params_update_post_handler(httpd_req_t *req); ///< Handles /update POST
static esp_err_t parameters_html_handler(httpd_req_t *req); ///< Handles /parameters.html GET
static esp_err_t captive_redirect_handler(httpd_req_t *req); ///< Handles captive portal redirect
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req); ///< Handles /sysinfo.json GET
static esp_err_t ota_firmware_handler(httpd_req_t *req); ///< Handles OTA firmware upload
static esp_err_t ota_filesystem_handler(httpd_req_t *req); ///< Handles OTA filesystem upload

// Wi-Fi and MQTT
static void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data); ///< WiFi event handler
static void mqtt_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data); ///< MQTT event handler
static bool test_mqtt_broker_connectivity(const char* broker_url); ///< Tests MQTT broker connectivity
static bool check_wifi_connection(void); ///< Checks WiFi connection
void wifi_init_sta(void); ///< Initializes WiFi in station mode
static void mqtt_app_start(void); ///< Starts MQTT client
void publish_sensor_data_mqtt(const char* topic, const char* json_data); ///< Publishes sensor data (legacy)
void publish_combined_sensor_mqtt(const char* topic, const char* json_data); ///< Publishes combined sensor data



// ==========================
//   UTILITY FUNCTIONS
// ==========================

/**
 * @brief Extracts a 16-bit unsigned integer from a buffer (big-endian).
 * @param buffer Pointer to byte array
 * @param offset Index to start reading
 * @return Extracted 16-bit unsigned integer
 * @uml{method: unpack_u16_be}
 *
 * This function reads two consecutive bytes from the buffer starting at 'offset',
 * and combines them into a single 16-bit unsigned integer using big-endian order.
 * Example: buffer[offset] = MSB, buffer[offset+1] = LSB.
 */
uint16_t unpack_u16_be(const uint8_t *buffer, int offset) {
    // Combine two consecutive bytes into a 16-bit value.
    // buffer[offset] is the most significant byte, buffer[offset+1] is the least significant.
    return ((uint16_t)buffer[offset] << 8) | buffer[offset + 1];
}

/**
 * @brief Extracts an 8-bit unsigned integer from a buffer.
 * @param buffer Pointer to byte array
 * @param offset Index to read
 * @return Extracted 8-bit unsigned integer
 * @uml{method: unpack_u8}
 *
 * This function returns the byte at the specified offset in the buffer.
 */
uint8_t unpack_u8(const uint8_t *buffer, int offset) {
    // Directly return the byte at the specified offset.
    return buffer[offset];
}

// TEMPLATE: Main sensor data reading function
// Replace this function with your specific sensor reading logic
// Function to read all enabled sensors and publish combined data

/**
 * @brief Reads all enabled sensors and publishes combined data to MQTT.
 * @return true if any sensor was read and published successfully, false otherwise
 * @uml{method: read_sensor_data}
 * @uml{calls: sensor_config_is_enabled, sensor_config_get_name, sensor_bh1750_read, sensor_bme680_read, sensor_wind_speed_read, publish_combined_sensor_mqtt}
 * @uml{note: TODO - Implement DHT22, DS18B20, BME280 reading}
 */
static bool read_sensor_data() {
    // Log the start of sensor reading
    ESP_LOGI(TAG, "Reading enabled sensors...");
    
    // Track if any sensor was successfully read and published
    bool any_sensor_successful = false;
    // Create JSON objects for combined output, processor info, and sensor data
    cJSON *combined_json = cJSON_CreateObject();
    cJSON *processor_json = cJSON_CreateObject();
    cJSON *sensors_json = cJSON_CreateObject();
    
    // Check for successful JSON object creation
    if (!combined_json || !processor_json || !sensors_json) {
        ESP_LOGE(TAG, "Failed to create JSON objects");
        if (combined_json) cJSON_Delete(combined_json);
        if (processor_json) cJSON_Delete(processor_json);
        if (sensors_json) cJSON_Delete(sensors_json);
        return false;
    }
    
    // Add processor metrics (system information) to processor_json
    int32_t wifi_rssi_percent = get_wifi_rssi_percent(); // Get WiFi signal strength
    cJSON_AddNumberToObject(processor_json, "WiFiRSSI", wifi_rssi_percent);
    
    char *ip_address = get_ip_address(); // Get device IP address
    cJSON_AddStringToObject(processor_json, "IPAddress", ip_address);
    
    float cpu_temp = get_cpu_temperature(); // Get CPU temperature
    cJSON_AddNumberToObject(processor_json, "CPUTemperature", cpu_temp);
    
    char *software_version = get_software_version(); // Get software version
    cJSON_AddStringToObject(processor_json, "SoftwareVersion", software_version);
    
    char *chip_id = get_chip_id(); // Get chip ID
    cJSON_AddStringToObject(processor_json, "ChipID", chip_id);
    
    cJSON_AddNumberToObject(processor_json, "WDTRestartCount", watchdog_reset_counter); // Add watchdog counter
    
    // Iterate through all sensor types and read enabled ones
    for (int i = 0; i < SENSOR_TYPE_MAX_COUNT; i++) {
        sensor_type_t sensor_type = (sensor_type_t)i;
        
        // Skip disabled sensors
        if (!sensor_config_is_enabled(sensor_type)) {
            ESP_LOGD(TAG, "Sensor %s is disabled, skipping", sensor_config_get_name(sensor_type));
            continue;
        }
        
        // Log which sensor is being read
        ESP_LOGI(TAG, "Reading %s sensor...", sensor_config_get_name(sensor_type));
        
        sensor_data_t sensor_data; // Structure to hold sensor data
        esp_err_t read_result = ESP_FAIL; // Default to failure
        
        // Read sensor based on type
        switch (sensor_type) {
            case SENSOR_TYPE_BH1750:
                // Read BH1750 light sensor
                read_result = sensor_bh1750_read(&sensor_data);
                break;
            case SENSOR_TYPE_BME680:
                // Read BME680 environmental sensor
                read_result = sensor_bme680_read(&sensor_data);
                break;
            case SENSOR_TYPE_DHT22:
                // TODO: Implement DHT22 reading
                ESP_LOGW(TAG, "DHT22 reading not yet implemented");
                continue;
            case SENSOR_TYPE_DS18B20:
                // TODO: Implement DS18B20 reading
                ESP_LOGW(TAG, "DS18B20 reading not yet implemented");
                continue;
            case SENSOR_TYPE_BME280:
                // TODO: Implement BME280 reading
                ESP_LOGW(TAG, "BME280 reading not yet implemented");
                continue;
            case SENSOR_TYPE_WIND_SPEED:
                // Read wind speed sensor
                read_result = sensor_wind_speed_read(&sensor_data);
                break;
            default:
                // Unknown sensor type
                ESP_LOGW(TAG, "Unknown sensor type: %d", sensor_type);
                continue;
        }
        
