JohnDevine/ESP32-MQTT-Weather/src/main.c
        // If sensor read was successful and data is valid
        if (read_result == ESP_OK && sensor_data.valid) {
            // Create a JSON object for this sensor
            cJSON *sensor_obj = cJSON_CreateObject();
            if (sensor_obj) {
                // Add sensor metadata
                cJSON_AddStringToObject(sensor_obj, "name", sensor_config_get_name(sensor_type));
                cJSON_AddBoolToObject(sensor_obj, "valid", sensor_data.valid);
                
                // Add sensor-specific data fields
                switch (sensor_type) {
                    case SENSOR_TYPE_BH1750:
                        // Add BH1750 lux value
                        cJSON_AddNumberToObject(sensor_obj, "lux", sensor_data.data.bh1750.lux);
                        cJSON_AddItemToObject(sensors_json, "bh1750", sensor_obj);
                        break;
                    case SENSOR_TYPE_BME680:
                        // Add BME680 temperature, humidity, pressure, gas resistance
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.bme680.temperature);
                        cJSON_AddNumberToObject(sensor_obj, "humidity", sensor_data.data.bme680.humidity);
                        cJSON_AddNumberToObject(sensor_obj, "pressure", sensor_data.data.bme680.pressure);
                        cJSON_AddNumberToObject(sensor_obj, "gas_resistance", sensor_data.data.bme680.gas_resistance);
                        cJSON_AddItemToObject(sensors_json, "bme680", sensor_obj);
                        break;
                    case SENSOR_TYPE_DHT22:
                        // Add DHT22 temperature and humidity
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.dht22.temperature);
                        cJSON_AddNumberToObject(sensor_obj, "humidity", sensor_data.data.dht22.humidity);
                        cJSON_AddItemToObject(sensors_json, "dht22", sensor_obj);
                        break;
                    case SENSOR_TYPE_DS18B20:
                        // Add DS18B20 temperature
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.ds18b20.temperature);
                        cJSON_AddItemToObject(sensors_json, "ds18b20", sensor_obj);
                        break;
                    case SENSOR_TYPE_BME280:
                        // Add BME280 temperature, humidity, pressure
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.bme280.temperature);
                        cJSON_AddNumberToObject(sensor_obj, "humidity", sensor_data.data.bme280.humidity);
                        cJSON_AddNumberToObject(sensor_obj, "pressure", sensor_data.data.bme280.pressure);
                        cJSON_AddItemToObject(sensors_json, "bme280", sensor_obj);
                        break;
                    case SENSOR_TYPE_WIND_SPEED:
                        // Add wind speed, average, gust, and raw reading
                        cJSON_AddNumberToObject(sensor_obj, "wind_speed", sensor_data.data.wind_speed.wind_speed);
                        cJSON_AddNumberToObject(sensor_obj, "wind_speed_avg", sensor_data.data.wind_speed.wind_speed_avg);
                        cJSON_AddNumberToObject(sensor_obj, "wind_gust", sensor_data.data.wind_speed.wind_gust);
                        cJSON_AddNumberToObject(sensor_obj, "raw_reading", sensor_data.data.wind_speed.raw_reading);
                        cJSON_AddItemToObject(sensors_json, "wind_speed", sensor_obj);
                        break;
                    default:
                        // Unknown sensor type, clean up
                        cJSON_Delete(sensor_obj);
                        continue;
                }
                // Mark that at least one sensor was successful
                any_sensor_successful = true;
                ESP_LOGI(TAG, "%s sensor reading successful", sensor_config_get_name(sensor_type));
            }
        } else {
            // Log sensor read failure
            ESP_LOGE(TAG, "%s sensor reading failed", sensor_config_get_name(sensor_type));
        }
    }
    
    // Combine processor and sensor data into the final JSON
    cJSON_AddItemToObject(combined_json, "processor", processor_json);
    cJSON_AddItemToObject(combined_json, "sensors", sensors_json);
    
    // Publish the combined message to the main data topic
    char *json_string = cJSON_PrintUnformatted(combined_json);
    if (json_string && any_sensor_successful) {
        publish_combined_sensor_mqtt(data_topic, json_string); // Publish to MQTT
        ESP_LOGI(TAG, "Combined sensor data published successfully");
        free(json_string);
        cJSON_Delete(combined_json);
        return true;
    } else {
        ESP_LOGW(TAG, "No sensor data to publish or JSON creation failed");
        if (json_string) free(json_string);
        cJSON_Delete(combined_json);
        return false;
    }
}

// Place these functions before app_main so they are visible to it
// Load WiFi configuration from NVS (persistent storage)
void load_wifi_config_from_nvs() {
    nvs_handle_t nvs_handle;
    // Open NVS namespace for WiFi config
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        size_t ssid_len = sizeof(wifi_ssid);
        size_t pass_len = sizeof(wifi_pass);
        // Try to read SSID from NVS, fallback to default if not found
        if (nvs_get_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid, &ssid_len) != ESP_OK) {
            strncpy(wifi_ssid, DEFAULT_WIFI_SSID, sizeof(wifi_ssid)-1);
            nvs_set_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid);
        }
        // Try to read password from NVS, fallback to default if not found
        if (nvs_get_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass, &pass_len) != ESP_OK) {
            strncpy(wifi_pass, DEFAULT_WIFI_PASS, sizeof(wifi_pass)-1);
            nvs_set_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass);
        }
        // Commit changes and close NVS handle
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    } else {
        // If NVS open fails, use default values
        strncpy(wifi_ssid, DEFAULT_WIFI_SSID, sizeof(wifi_ssid)-1);
        strncpy(wifi_pass, DEFAULT_WIFI_PASS, sizeof(wifi_pass)-1);
    }
}

// Load MQTT broker URL from NVS
void load_mqtt_config_from_nvs() {
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        size_t url_len = sizeof(mqtt_broker_url);
        // Try to read broker URL, fallback to default if not found
        if (nvs_get_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url, &url_len) != ESP_OK) {
            strncpy(mqtt_broker_url, DEFAULT_MQTT_BROKER_URL, sizeof(mqtt_broker_url)-1);
            nvs_set_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url);
        }
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    } else {
        strncpy(mqtt_broker_url, DEFAULT_MQTT_BROKER_URL, sizeof(mqtt_broker_url)-1);
    }
}

// Load sample interval from NVS
void load_sample_interval_from_nvs() {
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        int64_t val = 0;
        // Try to read sample interval, fallback to default if not found
        if (nvs_get_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, &val) == ESP_OK && val > 0) {
            sample_interval_ms = (long)val;
        } else {
            sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
            nvs_set_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, (int64_t)sample_interval_ms);
        }
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    } else {
        sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
    }
}

// Load MQTT data topic from NVS
void load_data_topic_from_nvs() {
    ESP_LOGI(TAG, "=== LOADING DATA TOPIC FROM NVS ===");
    ESP_LOGI(TAG, "Initial data_topic value: '%s'", data_topic);
    
