JohnDevine/ESP32-MQTT-Weather/src/main.c
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    ESP_LOGI(TAG, "NVS open result: %s", esp_err_to_name(err));
    
    if (err == ESP_OK) {
        size_t topic_len = sizeof(data_topic);
        ESP_LOGI(TAG, "Attempting to read NVS key '%s', buffer size: %d", NVS_KEY_DATA_TOPIC, topic_len);
        // Try to read topic, fallback to default if not found
        esp_err_t get_err = nvs_get_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic, &topic_len);
        ESP_LOGI(TAG, "NVS get_str result: %s", esp_err_to_name(get_err));
        
        if (get_err != ESP_OK) {
            ESP_LOGW(TAG, "Data topic not found in NVS (error: %s), using default: Data/BH1750", esp_err_to_name(get_err));
            strncpy(data_topic, "Data/BH1750", sizeof(data_topic)-1);
            data_topic[sizeof(data_topic)-1] = '\0';
            esp_err_t set_err = nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic);
            ESP_LOGI(TAG, "Default Data topic save result: %s", esp_err_to_name(set_err));
            nvs_commit(nvs_handle);
        } else {
            ESP_LOGI(TAG, "Successfully loaded Data topic from NVS: '%s' (length: %d)", data_topic, topic_len);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for Data topic: %s", esp_err_to_name(err));
        strncpy(data_topic, "Data/BH1750", sizeof(data_topic)-1);
        data_topic[sizeof(data_topic)-1] = '\0';
    }
    ESP_LOGI(TAG, "=== FINAL DATA TOPIC: '%s' ===", data_topic);
}

void save_data_topic_to_nvs(const char *topic) {
    nvs_handle_t nvs_handle;
    if (nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle) == ESP_OK) {
        nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, topic);
        nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
    }
}

void load_watchdog_counter_from_nvs() {
    ESP_LOGI(TAG, "=== LOADING WATCHDOG COUNTER FROM NVS ===");
    ESP_LOGI(TAG, "Initial watchdog_reset_counter value: %lu", watchdog_reset_counter);
    
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    ESP_LOGI(TAG, "NVS open result: %s", esp_err_to_name(err));
    
    if (err == ESP_OK) {
        uint32_t val = 0;
        esp_err_t get_err = nvs_get_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, &val);
        ESP_LOGI(TAG, "NVS get_u32 result: %s", esp_err_to_name(get_err));
        
        if (get_err == ESP_OK) {
            watchdog_reset_counter = val;
            ESP_LOGI(TAG, "Successfully loaded watchdog counter from NVS: %lu", watchdog_reset_counter);
        } else {
            ESP_LOGW(TAG, "Watchdog counter not found in NVS (error: %s), using default: 0", esp_err_to_name(get_err));
            watchdog_reset_counter = 0;
            esp_err_t set_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
            ESP_LOGI(TAG, "Default watchdog counter save result: %s", esp_err_to_name(set_err));
            nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for watchdog counter: %s", esp_err_to_name(err));
        watchdog_reset_counter = 0;
    }
    ESP_LOGI(TAG, "=== FINAL WATCHDOG COUNTER: %lu ===", watchdog_reset_counter);
}

void save_watchdog_counter_to_nvs() {
    ESP_LOGI(TAG, "=== SAVING WATCHDOG COUNTER TO NVS ===");
    ESP_LOGI(TAG, "Saving watchdog_reset_counter: %lu", watchdog_reset_counter);
    
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err == ESP_OK) {
        esp_err_t set_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
        ESP_LOGI(TAG, "NVS set_u32 result: %s", esp_err_to_name(set_err));
        if (set_err == ESP_OK) {
            nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
    } else {
        ESP_LOGE(TAG, "Failed to open NVS for saving watchdog counter: %s", esp_err_to_name(err));
    }
}




// SPIFFS init
void init_spiffs() {
    ESP_LOGI(TAG, "Initializing SPIFFS...");
    esp_vfs_spiffs_conf_t conf = {
        .base_path = "/spiffs",
        .partition_label = NULL,
        .max_files = 5,
        .format_if_mount_failed = true
    };
    
    ESP_ERROR_CHECK(esp_vfs_spiffs_register(&conf));
    
    size_t total = 0, used = 0;
    esp_err_t ret = esp_spiffs_info(NULL, &total, &used);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
    } else {
        ESP_LOGI(TAG, "SPIFFS: %d kB total, %d kB used", total / 1024, used / 1024);
    }
}

// HTTP handler for /params.json
// HTTP handler for /params.json endpoint
esp_err_t params_json_get_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "=== PARAMS.JSON REQUEST ===");
    // Show watchdog counter before and after reload for debugging
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before reload: %lu ***", watchdog_reset_counter);
    load_watchdog_counter_from_nvs(); // Reload latest value from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after reload: %lu ***", watchdog_reset_counter);
    // Log current configuration values
    ESP_LOGI(TAG, "Current data_topic variable: '%s'", data_topic);
    ESP_LOGI(TAG, "Current wifi_ssid: '%s'", wifi_ssid);
    ESP_LOGI(TAG, "Current mqtt_broker_url: '%s'", mqtt_broker_url);
    ESP_LOGI(TAG, "Current sample_interval_ms: %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Current watchdog_reset_counter: %lu", watchdog_reset_counter);
    // Create JSON response object
    cJSON *json = cJSON_CreateObject();
    cJSON *sensors = cJSON_CreateObject();
    // Add basic configuration to JSON
    cJSON_AddStringToObject(json, "ssid", wifi_ssid);
    cJSON_AddStringToObject(json, "password", wifi_pass);
    cJSON_AddStringToObject(json, "mqtt_url", mqtt_broker_url);
    cJSON_AddNumberToObject(json, "sample_interval", sample_interval_ms);
    cJSON_AddStringToObject(json, "data_topic", data_topic);
    cJSON_AddNumberToObject(json, "watchdog_reset_counter", watchdog_reset_counter);
    // Add sensor configurations to JSON
    for (int i = 0; i < SENSOR_TYPE_MAX_COUNT; i++) {
        sensor_config_t *config = sensor_config_get((sensor_type_t)i);
        if (config) {
            cJSON *sensor_obj = cJSON_CreateObject();
            cJSON_AddBoolToObject(sensor_obj, "enabled", config->enabled);
            cJSON_AddStringToObject(sensor_obj, "name", config->name);
            // Add sensor-specific objects by type
            switch (i) {
                case SENSOR_TYPE_BH1750:
                    cJSON_AddItemToObject(sensors, "bh1750", sensor_obj);
                    break;
                case SENSOR_TYPE_BME680:
                    cJSON_AddItemToObject(sensors, "bme680", sensor_obj);
                    break;
                case SENSOR_TYPE_DHT22:
                    cJSON_AddItemToObject(sensors, "dht22", sensor_obj);
                    break;
                case SENSOR_TYPE_DS18B20:
                    cJSON_AddItemToObject(sensors, "ds18b20", sensor_obj);
                    break;
                case SENSOR_TYPE_BME280:
                    cJSON_AddItemToObject(sensors, "bme280", sensor_obj);
                    break;
                case SENSOR_TYPE_WIND_SPEED:
                    cJSON_AddItemToObject(sensors, "wind_speed", sensor_obj);
                    break;
                default:
                    cJSON_Delete(sensor_obj); // Clean up unused sensor object
                    break;
            }
        }
    }
    cJSON_AddItemToObject(json, "sensors", sensors);
    // Add wind speed configuration parameters from NVS
    nvs_handle_t wind_nvs_handle;
    esp_err_t nvs_err = nvs_open("wind_config", NVS_READONLY, &wind_nvs_handle);
    if (nvs_err == ESP_OK) {
        uint32_t reading_interval = 2000;
        uint32_t avg_period = 60000;
        uint32_t gust_period = 300000;
        nvs_get_u32(wind_nvs_handle, "reading_interval", &reading_interval);
        nvs_get_u32(wind_nvs_handle, "avg_period", &avg_period);
        nvs_get_u32(wind_nvs_handle, "gust_period", &gust_period);
        cJSON_AddNumberToObject(json, "wind_reading_interval_ms", reading_interval);
        cJSON_AddNumberToObject(json, "wind_avg_period_ms", avg_period);
        cJSON_AddNumberToObject(json, "wind_gust_period_ms", gust_period);
        nvs_close(wind_nvs_handle);
        ESP_LOGI(TAG, "Wind config loaded: interval=%lu, avg=%lu, gust=%lu", reading_interval, avg_period, gust_period);
    } else {
        // Use default values if config not found
        cJSON_AddNumberToObject(json, "wind_reading_interval_ms", 2000);
        cJSON_AddNumberToObject(json, "wind_avg_period_ms", 60000);
        cJSON_AddNumberToObject(json, "wind_gust_period_ms", 300000);
        ESP_LOGI(TAG, "Wind config NVS not found, using defaults");
    }
    // Print and send JSON response
    char *json_string = cJSON_Print(json);
    ESP_LOGI(TAG, "Sending params.json response: %s", json_string);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_string, HTTPD_RESP_USE_STRLEN);
    free(json_string);
    cJSON_Delete(json);
    ESP_LOGI(TAG, "=== PARAMS.JSON RESPONSE SENT ===");
    return ESP_OK;
}

// Global flag to signal shutdown
static bool system_shutting_down = false;

// Reboot task function
static void reboot_task(void *param) {
    ESP_LOGI(TAG, "Reboot task started, shutting down gracefully...");
    
    // Set shutdown flag to signal other tasks to stop
    system_shutting_down = true;
    
    // Give time for HTTP response to complete
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    
    ESP_LOGI(TAG, "Disabling task watchdog before restart...");
    esp_task_wdt_deinit();
    
    // Give a bit more time for tasks to see the shutdown flag
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    
    ESP_LOGI(TAG, "Performing system restart NOW...");
    fflush(stdout);  // Ensure log message is sent
    
    esp_restart();
    
