JohnDevine/ESP32-MQTT-Weather/src/main.c
    // This line should never be reached
    vTaskDelete(NULL);
}

// HTTP handler for /update (POST)
esp_err_t params_update_post_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "=== UPDATE REQUEST RECEIVED ===");
    
    char buf[512];
    int ret = httpd_req_recv(req, buf, sizeof(buf)-1);
    if (ret <= 0) {
        ESP_LOGE(TAG, "Failed to receive update data");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    buf[ret] = 0;
    
    ESP_LOGI(TAG, "Received update data: %s", buf);
    
    char ssid[33] = "", pass[65] = "", mqtt_url[128] = "";
    long interval = 5000;
    sscanf(strstr(buf, "ssid=")+5, "%32[^&]", ssid);
    sscanf(strstr(buf, "password=")+9, "%64[^&]", pass);
    sscanf(strstr(buf, "mqtt_url=")+9, "%127[^&]", mqtt_url);
    sscanf(strstr(buf, "sample_interval=")+15, "%ld", &interval);  // Fixed: "sample_interval=" is 15 chars, not 16
    // Decode URL-encoded values
    char ssid_dec[33], pass_dec[65], url_dec[128];
    url_decode(ssid_dec, ssid, sizeof(ssid_dec));
    url_decode(pass_dec, pass, sizeof(pass_dec));
    url_decode(url_dec, mqtt_url, sizeof(url_dec));
    strncpy(wifi_ssid, ssid_dec, sizeof(wifi_ssid)-1);
    strncpy(wifi_pass, pass_dec, sizeof(wifi_pass)-1);
    strncpy(mqtt_broker_url, url_dec, sizeof(mqtt_broker_url)-1);
    sample_interval_ms = interval;
    // Save to NVS
    nvs_handle_t nvs_handle;
    nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    nvs_set_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid);
    nvs_set_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass);
    nvs_set_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url);
    nvs_set_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, (int64_t)sample_interval_ms);
    // Handle Data topic
    ESP_LOGI(TAG, "=== PROCESSING DATA TOPIC ===");
    ESP_LOGI(TAG, "Current data_topic before update: '%s'", data_topic);
    
    char data_topic_in[41] = "";
    char data_topic_dec[41];
    char *data_topic_ptr = strstr(buf, "data_topic=");
    if (data_topic_ptr) {
        sscanf(data_topic_ptr + 11, "%40[^&]", data_topic_in);  // Fixed: "data_topic=" is 11 chars, not 10
        ESP_LOGI(TAG, "Raw Data topic from form: '%s'", data_topic_in);
        
        url_decode(data_topic_dec, data_topic_in, sizeof(data_topic_dec));
        ESP_LOGI(TAG, "URL decoded Data topic: '%s'", data_topic_dec);
        
        strncpy(data_topic, data_topic_dec, sizeof(data_topic)-1);
        data_topic[sizeof(data_topic)-1] = '\0';
        ESP_LOGI(TAG, "Data topic updated to: '%s'", data_topic);
    } else {
        ESP_LOGW(TAG, "No data_topic found in request data: %s", buf);
    }
    
    esp_err_t nvs_err = nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic);
    ESP_LOGI(TAG, "Saved Data topic '%s' to NVS with key '%s': %s", data_topic, NVS_KEY_DATA_TOPIC, esp_err_to_name(nvs_err));
    ESP_LOGI(TAG, "=== DATA TOPIC PROCESSING COMPLETE ===");
    
    ESP_LOGI(TAG, "=== PARAMETER UPDATE PROCESSING COMPLETE ===");
    
    // Handle Watchdog Reset Counter
    ESP_LOGI(TAG, "=== PROCESSING WATCHDOG RESET COUNTER ===");
    ESP_LOGI(TAG, "Current watchdog_reset_counter before update: %lu", watchdog_reset_counter);
    
    char *watchdog_counter_ptr = strstr(buf, "watchdog_reset_counter=");
    if (watchdog_counter_ptr) {
        uint32_t counter_value = 0;
        sscanf(watchdog_counter_ptr + 23, "%lu", &counter_value);
        ESP_LOGI(TAG, "Watchdog counter from form: %lu", counter_value);
        
        watchdog_reset_counter = counter_value;
        ESP_LOGI(TAG, "Watchdog reset counter updated to: %lu", watchdog_reset_counter);
    } else {
        ESP_LOGW(TAG, "No watchdog_reset_counter found in request data: %s", buf);
    }
    
    esp_err_t watchdog_nvs_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
    ESP_LOGI(TAG, "Saved watchdog counter %lu to NVS with key '%s': %s", watchdog_reset_counter, NVS_KEY_WATCHDOG_COUNTER, esp_err_to_name(watchdog_nvs_err));
    ESP_LOGI(TAG, "=== WATCHDOG RESET COUNTER PROCESSING COMPLETE ===");
    
    // Handle Sensor Configuration Updates
    ESP_LOGI(TAG, "=== PROCESSING SENSOR CONFIGURATIONS ===");
    
    // BH1750 Light Sensor
    if (strstr(buf, "sensor_bh1750_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_BH1750, true);
        ESP_LOGI(TAG, "BH1750 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_BH1750, false);
        ESP_LOGI(TAG, "BH1750 sensor disabled");
    }
    
    char *bh1750_name_ptr = strstr(buf, "sensor_bh1750_name=");
    if (bh1750_name_ptr) {
        char name_in[32], name_dec[32];
        sscanf(bh1750_name_ptr + 19, "%31[^&]", name_in);
        url_decode(name_dec, name_in, sizeof(name_dec));
        sensor_config_set_name(SENSOR_TYPE_BH1750, name_dec);
        ESP_LOGI(TAG, "BH1750 name set to: '%s'", name_dec);
    }
    
    // BME680 Environmental Sensor
    if (strstr(buf, "sensor_bme680_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_BME680, true);
        ESP_LOGI(TAG, "BME680 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_BME680, false);
        ESP_LOGI(TAG, "BME680 sensor disabled");
    }
    
    char *bme680_topic_ptr = strstr(buf, "sensor_bme680_topic=");
    if (bme680_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(bme680_topic_ptr + 20, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_BME680, topic_dec);
        ESP_LOGI(TAG, "BME680 topic set to: '%s'", topic_dec);
    }
    
    // DHT22 Temperature/Humidity
    if (strstr(buf, "sensor_dht22_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_DHT22, true);
        ESP_LOGI(TAG, "DHT22 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_DHT22, false);
        ESP_LOGI(TAG, "DHT22 sensor disabled");
    }
    
    char *dht22_topic_ptr = strstr(buf, "sensor_dht22_topic=");
    if (dht22_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(dht22_topic_ptr + 19, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_DHT22, topic_dec);
        ESP_LOGI(TAG, "DHT22 topic set to: '%s'", topic_dec);
    }
    
    // DS18B20 Temperature
    if (strstr(buf, "sensor_ds18b20_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_DS18B20, true);
        ESP_LOGI(TAG, "DS18B20 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_DS18B20, false);
        ESP_LOGI(TAG, "DS18B20 sensor disabled");
    }
    
    char *ds18b20_topic_ptr = strstr(buf, "sensor_ds18b20_topic=");
    if (ds18b20_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(ds18b20_topic_ptr + 21, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_DS18B20, topic_dec);
        ESP_LOGI(TAG, "DS18B20 topic set to: '%s'", topic_dec);
    }
    
    // BME280 Climate
    if (strstr(buf, "sensor_bme280_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_BME280, true);
        ESP_LOGI(TAG, "BME280 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_BME280, false);
        ESP_LOGI(TAG, "BME280 sensor disabled");
    }
    
    char *bme280_topic_ptr = strstr(buf, "sensor_bme280_topic=");
    if (bme280_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(bme280_topic_ptr + 20, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_BME280, topic_dec);
        ESP_LOGI(TAG, "BME280 topic set to: '%s'", topic_dec);
    }
    
    // Wind Speed Sensor
    if (strstr(buf, "sensor_wind_speed_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_WIND_SPEED, true);
        ESP_LOGI(TAG, "Wind Speed sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_WIND_SPEED, false);
        ESP_LOGI(TAG, "Wind Speed sensor disabled");
    }
    
    char *wind_speed_name_ptr = strstr(buf, "sensor_wind_speed_name=");
    if (wind_speed_name_ptr) {
        char name_in[32], name_dec[32];
        sscanf(wind_speed_name_ptr + 23, "%31[^&]", name_in);
        url_decode(name_dec, name_in, sizeof(name_dec));
        sensor_config_set_name(SENSOR_TYPE_WIND_SPEED, name_dec);
        ESP_LOGI(TAG, "Wind Speed name set to: '%s'", name_dec);
    }
    
