JohnDevine/ESP32-MQTT-Weather/src/main.c
    // Handle preflight requests
    if (req->method == HTTP_OPTIONS) {
        httpd_resp_send(req, NULL, 0);
        return ESP_OK;
    }
    
    esp_ota_handle_t ota_handle = 0;
    const esp_partition_t *ota_partition = NULL;
    esp_err_t err = ESP_OK;
    char *buf = NULL;
    const size_t buffer_size = 2048;  // Reduced buffer size for better memory management
    int received = 0;
    int remaining = req->content_len;

    ESP_LOGI(TAG, "Starting OTA firmware update, size: %d bytes", remaining);
    
    // Allocate buffer on heap to avoid stack overflow
    buf = malloc(buffer_size);
    if (!buf) {
        ESP_LOGE(TAG, "Failed to allocate %d bytes for upload buffer", buffer_size);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Memory allocation failed");
        return ESP_FAIL;
    }

    // Get next OTA partition
    ota_partition = esp_ota_get_next_update_partition(NULL);
    if (!ota_partition) {
        ESP_LOGE(TAG, "No OTA partition found");
        free(buf);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No OTA partition found");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Writing to partition subtype %d at offset 0x%lx", 
             ota_partition->subtype, ota_partition->address);

    // Begin OTA
    err = esp_ota_begin(ota_partition, OTA_WITH_SEQUENTIAL_WRITES, &ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_begin failed: %s", esp_err_to_name(err));
        free(buf);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA begin failed");
        return ESP_FAIL;
    }

    // Receive and write firmware data
    int timeout_count = 0;
    int zero_recv_count = 0;
    int last_fw_progress = -1;  // Move static variable to local scope
    
    while (remaining > 0) {
        int chunk_size = (remaining < buffer_size) ? remaining : buffer_size;
        int recv_len = httpd_req_recv(req, buf, chunk_size);
        
        if (recv_len < 0) {
            if (recv_len == HTTPD_SOCK_ERR_TIMEOUT) {
                timeout_count++;
                ESP_LOGW(TAG, "Socket timeout #%d, continuing... (%d bytes remaining)", timeout_count, remaining);
                if (timeout_count > 15) {  // Increased tolerance for large files
                    ESP_LOGE(TAG, "Too many timeouts, aborting");
                    esp_ota_abort(ota_handle);
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_408_REQ_TIMEOUT, "Upload timeout - too many socket timeouts");
                    return ESP_FAIL;
                }
                vTaskDelay(pdMS_TO_TICKS(200));  // Longer delay for large file processing
                continue;
            }
            ESP_LOGE(TAG, "File reception failed with error: %d", recv_len);
            esp_ota_abort(ota_handle);
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File reception failed - connection error");
            return ESP_FAIL;
        }
        
        if (recv_len == 0) {
            zero_recv_count++;
            ESP_LOGW(TAG, "Received 0 bytes #%d, continuing... (%d bytes remaining)", zero_recv_count, remaining);
            if (zero_recv_count > 8) {  // Increased tolerance for large files
                ESP_LOGE(TAG, "Too many zero-byte receives, connection likely closed");
                esp_ota_abort(ota_handle);
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Connection closed unexpectedly");
                return ESP_FAIL;
            }
            vTaskDelay(pdMS_TO_TICKS(100));  // Longer delay before retry
            continue;
        }
        
        // Reset counters on successful receive
        timeout_count = 0;
        zero_recv_count = 0;

        err = esp_ota_write(ota_handle, buf, recv_len);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "esp_ota_write failed: %s", esp_err_to_name(err));
            esp_ota_abort(ota_handle);
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA write failed - firmware corrupted?");
            return ESP_FAIL;
        }

        received += recv_len;
        remaining -= recv_len;
        
        // Log progress every 5% for large files
        int progress = (received * 100) / req->content_len;
        if (progress != last_fw_progress && progress % 5 == 0) {
            ESP_LOGI(TAG, "Firmware Progress: %d%% (%d/%d bytes, free heap: %lu)", 
                     progress, received, req->content_len, (unsigned long)esp_get_free_heap_size());
            last_fw_progress = progress;
        }
        
        // Yield to other tasks periodically for large uploads
        if ((received % (buffer_size * 4)) == 0) {
            vTaskDelay(pdMS_TO_TICKS(10));  // Brief yield every ~8KB
        }
    }

    free(buf);  // Clean up allocated buffer

    // End OTA
    err = esp_ota_end(ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_end failed: %s", esp_err_to_name(err));
        if (err == ESP_ERR_OTA_VALIDATE_FAILED) {
            httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Firmware validation failed - invalid binary");
        } else {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA end failed");
        }
        return ESP_FAIL;
    }

    // Set boot partition
    err = esp_ota_set_boot_partition(ota_partition);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_set_boot_partition failed: %s", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Set boot partition failed");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "OTA firmware update successful, rebooting...");
    httpd_resp_sendstr(req, "Firmware Update Successful! Rebooting...");
    
    // Reboot after a short delay
    vTaskDelay(pdMS_TO_TICKS(1000));
    esp_restart();
    
    return ESP_OK;
}

// OTA Filesystem Update Handler
static esp_err_t ota_filesystem_handler(httpd_req_t *req) {
    /**
     * @brief HTTP handler for OTA filesystem update
     * This function receives a filesystem image via HTTP POST and writes it to the SPIFFS partition.
     * It handles chunked uploads, error checking, and partition management.
     * On success, the new filesystem is written and the device can reboot to use it.
     *
     * @param req HTTP request pointer
     * @return ESP_OK on success, ESP_FAIL on error
     */
    ESP_LOGI(TAG, "OTA filesystem handler called - Content-Length: %d", req->content_len);
    ESP_LOGI(TAG, "Request method: %d, URI: %s", req->method, req->uri);
    
    // Add CORS headers
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "POST, OPTIONS");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");
    
