JohnDevine/ESP32-MQTT-Weather/src/main.c
            esp_err_t bme680_err = sensor_bme680_init();
            if (bme680_err == ESP_OK) {
                ESP_LOGI(TAG, "BME680 sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "BME680 sensor initialization failed: %s", esp_err_to_name(bme680_err));
            }
        } else {
            ESP_LOGW(TAG, "BME680 sensor is disabled in configuration");
        }
        
        // Initialize wind speed sensor if enabled
        if (sensor_config_is_enabled(SENSOR_TYPE_WIND_SPEED)) {
            ESP_LOGI(TAG, "Wind speed sensor is enabled, initializing...");
            esp_err_t wind_err = sensor_wind_speed_init();
            if (wind_err == ESP_OK) {
                ESP_LOGI(TAG, "Wind speed sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "Wind speed sensor initialization failed: %s", esp_err_to_name(wind_err));
            }
        } else {
            ESP_LOGW(TAG, "Wind speed sensor is disabled in configuration");
        }
    } else {
        ESP_LOGE(TAG, "Sensor configuration system initialization failed: %s", esp_err_to_name(sensor_init_err));
    }
    
    // Debug: Show watchdog counter after loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after NVS load (AP mode): %lu ***", watchdog_reset_counter);
    
    ESP_LOGI(TAG, "=== CONFIG LOADED FROM NVS (AP MODE) ===");
    ESP_LOGI(TAG, "WiFi SSID: %s", wifi_ssid);
    ESP_LOGI(TAG, "WiFi PASS: %s", wifi_pass);
    ESP_LOGI(TAG, "MQTT Broker URL: %s", mqtt_broker_url);
    ESP_LOGI(TAG, "Data Topic: %s", data_topic);
    ESP_LOGI(TAG, "Sample interval (ms): %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Watchdog reset counter: %lu", watchdog_reset_counter);
    ESP_LOGI(TAG, "=== STARTING AP CONFIG MODE ===");
    
    // Note: esp_netif_init() and esp_event_loop_create_default() 
    // are already called in main app initialization
    
    // Start the captive portal
    start_ap_and_captive_portal();
    
    // Wait a moment for the HTTP server to stabilize
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    // Start DNS hijack server for captive portal
    TaskHandle_t dns_task_handle = NULL;
    BaseType_t dns_task_result = xTaskCreate(dns_hijack_task, "dns_hijack_task", 4096, NULL, 4, &dns_task_handle);
    if (dns_task_result == pdPASS) {
        ESP_LOGI(TAG, "DNS hijack task started successfully");
    } else {
        ESP_LOGE(TAG, "Failed to create DNS hijack task");
    }
    
    ESP_LOGI(TAG, "AP configuration mode fully initialized");
    ESP_LOGI(TAG, "Connect to ESP32-CONFIG-XXXX network and visit any website to configure");
    
    vTaskDelete(NULL);
}

// Blink task for onboard LED
#define ONBOARD_LED_GPIO GPIO_NUM_2

// Blink the onboard LED for a short time (heartbeat)
void blink_heartbeat() {
    gpio_set_direction(ONBOARD_LED_GPIO, GPIO_MODE_OUTPUT);
    gpio_set_level(ONBOARD_LED_GPIO, 1);
    vTaskDelay(pdMS_TO_TICKS(50));
    gpio_set_level(ONBOARD_LED_GPIO, 0);
}

// Main application entry point.
void app_main(void) {
    // ============================================================
    // REDUCE LOGGING OUTPUT - Uncomment one of these lines:
    // ============================================================
    // esp_log_level_set("*", ESP_LOG_WARN);   // Show only warnings and errors
    esp_log_level_set("*", ESP_LOG_INFO);   // Show info, warnings and errors (for debugging)
    // esp_log_level_set("*", ESP_LOG_ERROR);  // Show only errors
    // esp_log_level_set("*", ESP_LOG_NONE);   // Turn off all logging
    
    // Initialize NVS first for all code paths
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // Debug: Show initial watchdog counter value at app start
    ESP_LOGI(TAG, "*** DEBUG: Initial watchdog_reset_counter at app start: %lu ***", watchdog_reset_counter);

    // Configure Task Watchdog Timer
    ESP_LOGI(TAG, "Configuring Task Watchdog Timer...");
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = 30000, // 30 second timeout
        .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Monitor all cores
        .trigger_panic = true // Trigger panic on timeout
    };
    esp_err_t twdt_err = esp_task_wdt_init(&twdt_config);
    ESP_LOGI(TAG, "esp_task_wdt_init() returned: %d", twdt_err);
    // No esp_task_wdt_get_timeout() in ESP-IDF; cannot log actual timeout at runtime
    if (twdt_err == ESP_ERR_INVALID_STATE) {
        ESP_LOGI(TAG, "Task Watchdog Timer already initialized");
    } else {
        ESP_ERROR_CHECK(twdt_err);
        ESP_LOGI(TAG, "Task Watchdog Timer initialized successfully");
    }
    ESP_ERROR_CHECK(esp_task_wdt_add(NULL)); // Add current task to watchdog
    ESP_LOGI(TAG, "Task Watchdog Timer configured successfully");

    // Initialize network stack early for both AP and STA modes
    ESP_LOGI(TAG, "Initializing network stack...");
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_LOGI(TAG, "Network stack initialized successfully");

    ESP_LOGI(TAG, "Waiting 10 seconds for boot button press...");
    gpio_set_direction(BOOT_BTN_GPIO, GPIO_MODE_INPUT);
    bool boot_btn_pressed = false;
    for (int i = 0; i < 1000; ++i) { // 10 seconds, check every 10ms
        if (gpio_get_level(BOOT_BTN_GPIO) == 0) {
            boot_btn_pressed = true;
            ESP_LOGI(TAG, "Boot button press detected during wait!");
            break;
        }
        // Feed watchdog every 100 iterations (1 second)
        if (i % 100 == 0) {
            esp_task_wdt_reset();
        }
        vTaskDelay(10 / portTICK_PERIOD_MS);
    }
    ESP_LOGI(TAG, "Boot button wait finished, continuing startup...");
    if (boot_btn_pressed) {
        ESP_LOGI(TAG, "Entering AP config mode due to boot button press.");
        xTaskCreate(ap_config_task, "ap_config_task", 8192, NULL, 5, NULL);
        while (1) {
            esp_task_wdt_reset(); // Feed watchdog in config mode
            vTaskDelay(1000/portTICK_PERIOD_MS); // Block forever
        }
    }

