JohnDevine/ESP32-MQTT-Weather/src/main.c
    // TEMPLATE: Legacy sensor initialization (now handled by sensor config system)
    // The new configurable sensor system handles sensor initialization based on configuration
    ESP_LOGI(TAG, "Legacy sensor initialization is handled by the configurable sensor system");

    // Debug: Show watchdog counter before loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before NVS load (normal mode): %lu ***", watchdog_reset_counter);

    load_wifi_config_from_nvs();
    load_mqtt_config_from_nvs();
    load_sample_interval_from_nvs();
    load_data_topic_from_nvs();
    load_watchdog_counter_from_nvs();
    
    // Initialize sensor configuration system
    ESP_LOGI(TAG, "Initializing sensor configuration system...");
    esp_err_t sensor_config_err = sensor_config_init();
    if (sensor_config_err != ESP_OK) {
        ESP_LOGE(TAG, "Sensor configuration initialization failed: %s", esp_err_to_name(sensor_config_err));
    } else {
        ESP_LOGI(TAG, "Sensor configuration system initialized successfully");
        
        // Initialize enabled sensors
        ESP_LOGI(TAG, "Initializing enabled sensors...");
        if (sensor_config_is_enabled(SENSOR_TYPE_BH1750)) {
            esp_err_t bh1750_err = sensor_bh1750_init();
            if (bh1750_err == ESP_OK) {
                ESP_LOGI(TAG, "BH1750 sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "BH1750 sensor initialization failed: %s", esp_err_to_name(bh1750_err));
            }
        }
        
        // DIAGNOSTIC: Scan I2C bus to see what devices are connected
        ESP_LOGI(TAG, "Running I2C bus diagnostic scan...");
        i2c_scanner_scan_bus();
        
        if (sensor_config_is_enabled(SENSOR_TYPE_BME680)) {
            ESP_LOGI(TAG, "BME680 sensor is enabled, initializing...");
            
            esp_err_t bme680_err = sensor_bme680_init();
            if (bme680_err == ESP_OK) {
                ESP_LOGI(TAG, "BME680 sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "BME680 sensor initialization failed: %s", esp_err_to_name(bme680_err));
            }
        }
        
        // Initialize wind speed sensor if enabled
        if (sensor_config_is_enabled(SENSOR_TYPE_WIND_SPEED)) {
            ESP_LOGI(TAG, "Wind speed sensor is enabled, initializing...");
            esp_err_t wind_err = sensor_wind_speed_init();
            if (wind_err == ESP_OK) {
                ESP_LOGI(TAG, "Wind speed sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "Wind speed sensor initialization failed: %s", esp_err_to_name(wind_err));
            }
        }
        
        // Add initialization for other sensors as they are implemented
        // if (sensor_config_is_enabled(SENSOR_TYPE_DHT22)) { ... }
        // if (sensor_config_is_enabled(SENSOR_TYPE_DS18B20)) { ... }
        // if (sensor_config_is_enabled(SENSOR_TYPE_BME280)) { ... }
        
        ESP_LOGI(TAG, "Sensor initialization complete");
    }
    
    // Debug: Show watchdog counter after loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after NVS load (normal mode): %lu ***", watchdog_reset_counter);
    
    ESP_LOGI(TAG, "=== CONFIG LOADED FROM NVS ===");
    ESP_LOGI(TAG, "WiFi SSID: %s", wifi_ssid);
    ESP_LOGI(TAG, "WiFi PASS: %s", wifi_pass);
    ESP_LOGI(TAG, "MQTT Broker URL: %s", mqtt_broker_url);
    ESP_LOGI(TAG, "Data Topic: %s", data_topic);
    ESP_LOGI(TAG, "Sample interval (ms): %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Watchdog reset counter: %lu", watchdog_reset_counter);
    
    // Initialize SPIFFS for normal operation mode
    ESP_LOGI(TAG, "About to call init_spiffs() in normal mode...");
    init_spiffs();
    ESP_LOGI(TAG, "init_spiffs() completed successfully in normal mode");
    
    ESP_LOGI(TAG, "=== STARTING WIFI INIT ===");
    ESP_LOGI(TAG, "ESP_WIFI_MODE_STA");
    wifi_init_sta(); // Initialize Wi-Fi
    
    // Initialize software watchdog
    /**
     * @brief Main entry point for ESP32-MQTT-Weather application
     * This function initializes system components, loads configuration, sets up sensors,
     * and enters the main loop to periodically read sensor data and publish to MQTT.
     *
     * Major steps:
     * 1. Set logging level for debugging
     * 2. Initialize NVS (persistent storage)
     * 3. Configure and start the Task Watchdog Timer
     * 4. Initialize network stack (WiFi, event loop)
     * 5. Wait for boot button press to enter AP config mode
     * 6. Load configuration from NVS (WiFi, MQTT, sample interval, data topic, watchdog)
     * 7. Initialize sensor configuration system and enabled sensors
     * 8. Initialize SPIFFS filesystem
     * 9. Initialize WiFi in station mode
     * 10. Configure software watchdog based on sample interval
     * 11. Main loop: read sensors, publish to MQTT, handle watchdog, delay
     */
    // Watchdog timeout is 10× sample interval (in ms), inactive if timeout ≤10,000 ms
    watchdog_timeout_ms = sample_interval_ms * 10;
    if (watchdog_timeout_ms > 10000) {
        watchdog_enabled = true;
        last_successful_publish = xTaskGetTickCount();
        ESP_LOGI(TAG, "Software watchdog enabled with timeout: %lu ms (10× sample interval)", watchdog_timeout_ms);
        ESP_LOGI(TAG, "WDT will reset ESP32 only if no MQTT data is published for %lu ms", watchdog_timeout_ms);
    } else {
        watchdog_enabled = false;
        ESP_LOGI(TAG, "Software watchdog inactive (timeout ≤10,000 ms, sample interval: %lu ms)", sample_interval_ms);
    }

    // Main loop to periodically read sensor data and publish to MQTT.
    while (1) {
        ESP_LOGD(TAG, "[MAIN LOOP] Start iteration");
        esp_task_wdt_reset();
    // Show initial watchdog counter value for debugging
        
        // Check software watchdog timeout - only triggers if no MQTT data published
    // Configure Task Watchdog Timer to monitor system health
        ESP_LOGD(TAG, "[MAIN LOOP] Check software watchdog");
        if (watchdog_enabled) {
            TickType_t current_time = xTaskGetTickCount();
            TickType_t elapsed_ms = pdTICKS_TO_MS(current_time - last_successful_publish);
            if (elapsed_ms >= watchdog_timeout_ms) {
                ESP_LOGE(TAG, "Software watchdog timeout! No successful MQTT publish in %lu ms (timeout: %lu ms)", elapsed_ms, watchdog_timeout_ms);
                
                // Debug: Show counter before increment
                ESP_LOGE(TAG, "*** DEBUG: watchdog_reset_counter BEFORE increment: %lu ***", watchdog_reset_counter);
                
                // Increment watchdog reset counter and save to NVS
                watchdog_reset_counter++;
                ESP_LOGE(TAG, "Incrementing watchdog reset counter to: %lu", watchdog_reset_counter);
                
                // Debug: Show counter after increment
                ESP_LOGE(TAG, "*** DEBUG: watchdog_reset_counter AFTER increment: %lu ***", watchdog_reset_counter);
                
                save_watchdog_counter_to_nvs();
    // Initialize network stack for WiFi and event handling
                
