JohnDevine/ESP32-MQTT-Weather/src/main.c
                // Debug: Verify save by reloading from NVS
                uint32_t verify_counter = 0;
                nvs_handle_t verify_handle;
                esp_err_t verify_err = nvs_open(WIFI_NVS_NAMESPACE, NVS_READONLY, &verify_handle);
    // Wait for boot button press to enter AP config mode (10 seconds)
                if (verify_err == ESP_OK) {
                    esp_err_t get_err = nvs_get_u32(verify_handle, NVS_KEY_WATCHDOG_COUNTER, &verify_counter);
                    ESP_LOGE(TAG, "*** DEBUG: Verification read from NVS result: %s, value: %lu ***", 
                             esp_err_to_name(get_err), verify_counter);
                    nvs_close(verify_handle);
                } else {
                    ESP_LOGE(TAG, "*** DEBUG: Failed to open NVS for verification: %s ***", esp_err_to_name(verify_err));
                }
                
                ESP_LOGE(TAG, "Forcing system restart...");
                vTaskDelay(pdMS_TO_TICKS(100));
                esp_restart();
            }
        }
        ESP_LOGD(TAG, "[MAIN LOOP] After software watchdog check");

        mqtt_publish_success = false;
        ESP_LOGD(TAG, "[MAIN LOOP] After reset mqtt_publish_success");

        // Read sensor data and attempt to publish if successful
        bool sensor_read_success = read_sensor_data();
        
        if (sensor_read_success) {
            ESP_LOGD(TAG, "[MAIN LOOP] Sensor read successful, data will be published to MQTT");
        } else {
    // Sensor initialization is now handled by the configurable sensor system
            ESP_LOGW(TAG, "[MAIN LOOP] Sensor read failed, no MQTT data will be published this cycle");
        }
    // Show watchdog counter before loading from NVS
        ESP_LOGD(TAG, "[MAIN LOOP] After read_sensor_data");

    // Load configuration from NVS (persistent storage)
        if (debug_logging) {
            ESP_LOGI(TAG, "Waiting %ld ms before next sensor read cycle...", sample_interval_ms);
        }
        if (sample_interval_ms > 5000) {
            uint32_t remaining_ms = sample_interval_ms;
            while (remaining_ms > 0) {
    // Initialize sensor configuration system and enabled sensors
                uint32_t chunk_ms = (remaining_ms > 5000) ? 5000 : remaining_ms;
                vTaskDelay(pdMS_TO_TICKS(chunk_ms));
                esp_task_wdt_reset();
                remaining_ms -= chunk_ms;
            }
        } else {
            vTaskDelay(pdMS_TO_TICKS(sample_interval_ms));
        }
        ESP_LOGD(TAG, "[MAIN LOOP] End of iteration, feeding TWDT");
        esp_task_wdt_reset();
    }
}

// Wi-Fi Event Handler
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    printf("[WIFI] Event handler called: base=%s, event_id=%ld\n", event_base, event_id);
    
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        printf("[WIFI] WIFI_EVENT_STA_START - calling esp_wifi_connect()\n");
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        printf("[WIFI] WIFI_EVENT_STA_DISCONNECTED - retry_num=%d\n", wifi_retry_num);
        if (wifi_retry_num < EXAMPLE_ESP_MAXIMUM_RETRY) {
            esp_wifi_connect();
            wifi_retry_num++;
            printf("[WIFI] retry to connect to the AP\n");
        } else {
            printf("[WIFI] connect to the AP fail\n");
            printf("[WIFI] WiFi SSID used: %s\n", wifi_ssid);
            printf("[WIFI] WiFi Password used: %s\n", wifi_pass);
        }
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        printf("[WIFI] IP_EVENT_STA_GOT_IP received!\n");
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        printf("[WIFI] got ip:" IPSTR "\n", IP2STR(&event->ip_info.ip));
        printf("Obtained IP address: " IPSTR "\n", IP2STR(&event->ip_info.ip));
        wifi_retry_num = 0;
        // Start MQTT client once IP is obtained
        printf("[WIFI] About to start MQTT client...\n");
        mqtt_app_start();
        printf("[WIFI] MQTT client start function completed\n");
    } else {
        printf("[WIFI] Unhandled event: base=%s, event_id=%ld\n", event_base, event_id);
    }
    printf("[WIFI] Event handler completed\n");
}

// Wi-Fi Initialization
void wifi_init_sta(void)
{
    // Show watchdog counter after loading from NVS
    // Note: esp_netif_init() and esp_event_loop_create_default() 
    // are already called in main app initialization
    // Log loaded configuration for debugging
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    esp_event_handler_instance_t instance_any_id;
    esp_event_handler_instance_t instance_got_ip;
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
    // Initialize SPIFFS filesystem for web interface and config
                                                        ESP_EVENT_ANY_ID,
                                                        &wifi_event_handler,
                                                        NULL,
                                                        &instance_any_id));
    // Initialize WiFi in station mode for normal operation
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                        IP_EVENT_STA_GOT_IP,
                                                        &wifi_event_handler,
                                                        NULL,
    // Configure software watchdog based on sample interval
                                                        &instance_got_ip));

    wifi_config_t wifi_config = {
        .sta = {
            .ssid = "",
            .password = "",
            .threshold.authmode = WIFI_AUTH_WPA2_PSK, // Or other appropriate authmode
        },
    };
    strncpy((char*)wifi_config.sta.ssid, wifi_ssid, sizeof(wifi_config.sta.ssid)-1);
    strncpy((char*)wifi_config.sta.password, wifi_pass, sizeof(wifi_config.sta.password)-1);
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA) );
    // Main loop: periodically read sensor data and publish to MQTT
    ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_config) );
    ESP_ERROR_CHECK(esp_wifi_start() );

    ESP_LOGI(TAG, "wifi_init_sta finished.");
}

// MQTT Event Handler
static void mqtt_event_handler(void* arg, esp_event_base_t event_base,
                               int32_t event_id, void* event_data) {
    ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%ld", event_base, event_id);
    esp_mqtt_event_handle_t event = event_data;
    printf("[MQTT] Event received: %ld\n", event_id);
    // esp_mqtt_client_handle_t client = event->client; // Not used in this basic handler
    // int msg_id; // Not used here
    switch ((esp_mqtt_event_id_t)event_id) {
    case MQTT_EVENT_CONNECTED:
        ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");
        printf("[MQTT] Connected to broker successfully!\n");
        // Example: Subscribe to a topic (optional)
        // msg_id = esp_mqtt_client_subscribe(client, "/topic/qos0", 0);
        // ESP_LOGI(TAG, "sent subscribe successful, msg_id=%d", msg_id);
        break;
    case MQTT_EVENT_DISCONNECTED:
        ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
        printf("[MQTT] Disconnected from broker\n");
        break;
    case MQTT_EVENT_SUBSCRIBED:
        ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
        break;
    case MQTT_EVENT_UNSUBSCRIBED:
        ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
        break;
    case MQTT_EVENT_PUBLISHED:
        ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
        printf("[MQTT] Message published successfully!\n");
        
        // Flash the LED to indicate successful MQTT publish (heartbeat)
        blink_heartbeat();
        
        // Reset the software watchdog timer (if enabled)
        if (watchdog_enabled) {
            last_successful_publish = xTaskGetTickCount(); // Update last publish time
        }
        break;
    case MQTT_EVENT_DATA: // Incoming data event (if subscribed)
        ESP_LOGI(TAG, "MQTT_EVENT_DATA");
        printf("TOPIC=%.*s\r\n", event->topic_len, event->topic);
        printf("DATA=%.*s\r\n", event->data_len, event->data);
        break;
    case MQTT_EVENT_ERROR:
        ESP_LOGI(TAG, "MQTT_EVENT_ERROR");
        printf("[MQTT] Connection error occurred!\n");
        if (event->error_handle->error_type == MQTT_ERROR_TYPE_TCP_TRANSPORT) {
            ESP_LOGE(TAG, "Last error code reported from esp-tls: 0x%x", event->error_handle->esp_tls_last_esp_err);
            ESP_LOGE(TAG, "Last tls stack error number: 0x%x", event->error_handle->esp_tls_stack_err);
            ESP_LOGE(TAG, "MQTT Broker URL: %s", mqtt_broker_url);
            printf("[MQTT] TCP Transport error - check broker URL and network connectivity\n");
            printf("[MQTT] Current broker: %s\n", mqtt_broker_url);
            printf("[MQTT] Possible issues:\n");
            printf("  1. Broker IP address not reachable\n");
            printf("  2. Broker not running on specified port (default 1883)\n");
            printf("  3. Network connectivity issues\n");
            printf("  4. Firewall blocking connection\n");
        } else if (event->error_handle->error_type == MQTT_ERROR_TYPE_CONNECTION_REFUSED) {
            ESP_LOGE(TAG, "Connection refused error: 0x%x", event->error_handle->connect_return_code);
            printf("[MQTT] Broker refused connection (code: 0x%x)\n", event->error_handle->connect_return_code);
            printf("[MQTT] Check broker configuration and authentication\n");
        } else {
            ESP_LOGW(TAG, "Unknown error type: 0x%x", event->error_handle->error_type);
            printf("[MQTT] Unknown error type: 0x%x\n", event->error_handle->error_type);
        }
        break;
    default:
        ESP_LOGI(TAG, "Other event id:%d", event->event_id);
        break;
    }
}

// Check WiFi connection status
static bool check_wifi_connection(void) {
    wifi_ap_record_t ap_info;
    esp_err_t ret = esp_wifi_sta_get_ap_info(&ap_info);
    
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✓ WiFi connected to: %s (RSSI: %d dBm)", ap_info.ssid, ap_info.rssi);
        
        // Get IP address
        esp_netif_ip_info_t ip_info;
        esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (netif && esp_netif_get_ip_info(netif, &ip_info) == ESP_OK) {
            ESP_LOGI(TAG, "✓ IP Address: " IPSTR, IP2STR(&ip_info.ip));
            ESP_LOGI(TAG, "✓ Gateway: " IPSTR, IP2STR(&ip_info.gw));
            printf("[WiFi] Connected - IP: " IPSTR "\n", IP2STR(&ip_info.ip));
            return true;
        }
    }
    
    ESP_LOGE(TAG, "✗ WiFi not connected");
    printf("[WiFi] Not connected - check WiFi credentials\n");
    return false;
}

// Test MQTT broker connectivity before attempting to connect
static bool test_mqtt_broker_connectivity(const char* broker_url) {
    // Extract IP and port from broker URL
    char ip_str[32];
    int port = 1883;  // Default MQTT port
    
