JohnDevine/ESP32-MQTT-Weather/src/main.c
static char* get_chip_id(void) {
    static char chip_id_str[13]; // 6 bytes * 2 hex chars + null terminator
    static bool chip_id_loaded = false;
    
    if (!chip_id_loaded) {
        uint8_t mac[6];
        esp_err_t ret = esp_efuse_mac_get_default(mac);
        if (ret == ESP_OK) {
            // Convert MAC address (last 6 bytes) to hex string
            snprintf(chip_id_str, sizeof(chip_id_str), "%02X%02X%02X%02X%02X%02X", 
                     mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        } else {
            snprintf(chip_id_str, sizeof(chip_id_str), "UNKNOWN");
            ESP_LOGE(TAG, "Failed to read chip ID: %s", esp_err_to_name(ret));
        }
        chip_id_loaded = true;
        ESP_LOGI(TAG, "ESP32 Chip ID: %s", chip_id_str);
    }
    return chip_id_str;
}

// Function to publish sensor data to MQTT broker
// Function to publish combined sensor data to main MQTT topic
void publish_combined_sensor_mqtt(const char* topic, const char* json_data) {
    if (!mqtt_client) {
        ESP_LOGE(TAG, "MQTT client not initialized!");
        return;
    }
    
    if (!topic || !json_data) {
        ESP_LOGE(TAG, "Invalid topic or JSON data");
        return;
    }
    
    ESP_LOGI(TAG, "Publishing combined sensor data to topic: %s", topic);
    ESP_LOGD(TAG, "JSON data: %s", json_data);
    
    int msg_id = esp_mqtt_client_publish(mqtt_client, topic, json_data, 0, 1, 0);
    if (msg_id >= 0) {
        ESP_LOGI(TAG, "Successfully published combined data to %s (msg_id: %d, length: %d)", topic, msg_id, strlen(json_data));
        
        // Update last successful publish time for watchdog
        last_successful_publish = xTaskGetTickCount();
        mqtt_publish_success = true;
    } else {
        ESP_LOGE(TAG, "Failed to publish combined data to %s (error: %d)", topic, msg_id);
    }
}

void publish_sensor_data_mqtt(const char* topic, const char* json_data) {
    // Legacy function - now just calls the combined sensor publish function
    // This is kept for backward compatibility but is not used in the new system
    if (debug_logging) printf("[DEBUG] Legacy publish_sensor_data_mqtt() called\n");
    
    if (!topic || !json_data) {
        ESP_LOGE(TAG, "Invalid topic or JSON data in legacy function");
        return;
    }
    
    publish_combined_sensor_mqtt(topic, json_data);
}

// Helper to convert hex char to int
int hex2int(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    return 0;
}

// URL decode utility (in-place)
void url_decode(char *dst, const char *src, size_t dstsize) {
    char a, b;
    size_t i = 0, j = 0;
    while (src[i] && j + 1 < dstsize) {
        if (src[i] == '%' && src[i+1] && src[i+2]) {
            if ((a = src[i+1]) && (b = src[i+2])) {
                dst[j++] = hex2int(a) * 16 + hex2int(b);
                i += 3;
            } else {
                dst[j++] = src[i++];
            }
        } else if (src[i] == '+') {
            dst[j++] = ' ';
            i++;
        } else {
            dst[j++] = src[i++];
        }
    }
    dst[j] = '\0';
}

// DNS hijack task for captive portal
void dns_hijack_task(void *pvParameter) {
    // Remove from watchdog to prevent conflicts during configuration mode
    // esp_task_wdt_add(NULL);
    
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (sock < 0) {
        ESP_LOGE(TAG, "Failed to create DNS socket: errno=%d", errno);
        vTaskDelete(NULL);
        return;
    }
    
    // Set socket options for better reliability
    int reuse = 1;
    if (setsockopt(sock, SOL_SOCKET, SO_REUSEADDR, &reuse, sizeof(reuse)) < 0) {
        ESP_LOGW(TAG, "Failed to set SO_REUSEADDR: errno=%d", errno);
    }
    
    struct sockaddr_in server_addr;
    memset(&server_addr, 0, sizeof(server_addr));
    server_addr.sin_family = AF_INET;
    server_addr.sin_port = htons(53);
    server_addr.sin_addr.s_addr = htonl(INADDR_ANY);
    
    if (bind(sock, (struct sockaddr *)&server_addr, sizeof(server_addr)) < 0) {
        ESP_LOGE(TAG, "Failed to bind DNS socket: errno=%d", errno);
        close(sock);
        vTaskDelete(NULL);
        return;
    }
    
    ESP_LOGI(TAG, "DNS hijack server started on UDP port 53");
    
    uint8_t buf[512];
    struct sockaddr_in client_addr;
    socklen_t addr_len = sizeof(client_addr);
    uint32_t dns_requests_handled = 0;
    
    // Set a more reasonable timeout
    struct timeval timeout;
    timeout.tv_sec = 5;  // Increased to 5 seconds
    timeout.tv_usec = 0;
    if (setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout)) < 0) {
        ESP_LOGW(TAG, "Failed to set socket timeout: errno=%d", errno);
    }
    
    while (!system_shutting_down) {  // Check shutdown flag
        int len = recvfrom(sock, buf, sizeof(buf), 0, (struct sockaddr *)&client_addr, &addr_len);
        
        if (len > 0 && len >= 12) {  // Valid DNS query minimum size
            dns_requests_handled++;
            ESP_LOGD(TAG, "DNS request #%lu received (%d bytes)", dns_requests_handled, len);
            
            // Minimal DNS response: copy ID, set response flags, answer count = 1
            uint8_t response[512];
            memcpy(response, buf, len);
            response[2] = 0x81; // QR=1, Opcode=0, AA=1, TC=0, RD=0
            response[3] = 0x80; // RA=1, Z=0, RCODE=0
            response[7] = 1;    // ANCOUNT = 1
            
            // Copy question section after header (12 bytes)
            int qlen = len - 12;
            if (qlen > 0 && qlen < 400) {  // Sanity check
                memcpy(response + 12, buf + 12, qlen);
                int pos = 12 + qlen;
                
                // Answer: pointer to name (0xC00C), type A, class IN, TTL, RDLENGTH, RDATA
                response[pos++] = 0xC0; response[pos++] = 0x0C;
                response[pos++] = 0x00; response[pos++] = 0x01; // Type A
                response[pos++] = 0x00; response[pos++] = 0x01; // Class IN
                response[pos++] = 0x00; response[pos++] = 0x00; response[pos++] = 0x00; response[pos++] = 0x3C; // TTL 60s
                response[pos++] = 0x00; response[pos++] = 0x04; // RDLENGTH 4
                response[pos++] = 192;  response[pos++] = 168;  response[pos++] = 4; response[pos++] = 1; // 192.168.4.1
                
